
import sys
sys.stdin = open('15989.txt')

# 1 : (1) - 1개
# 2 : (1 1), (2)- 2개
# 3 : (1 1 1), ((1 2) (2 1)), (3) - 3개
# 4 : (1 1 1 1), ((1 1 2), (1 2 1), (2 1 1)), (2 2), ((1 3), (3 1)) - 4개
# 5 : (1 1 1 1 1), ((1 1 1 2), (1 2 1 1), (1 1 2 1), (2 1 1 1)), ((2 3), (3 2)), ((1 1 3), (1 3 1), (3 1 1)) 4개


dp = [1] * 10001 # 1은 한개씩 모두 포함

for i in range(2, 10001): # 인덱스 0부터 # 1, 1, 2, 2, 3, 3
    dp[i] += dp[i - 2]

for j in range(3, 10001): # 인덱스 0부터 # 1, 1, 2, 3, 4, 5
    dp[j] += dp[j - 3]

T = int(input())

for _ in range(T):
    idx = int(input())
    print(dp[idx])

